package com.roulette.bidhelper.ui.bidinfo.spinners

val placeCategoryList = listOf(
    "지역제한선택", "서울", "부산", "인천", "대구", "광주", "대전", "울산", "세종",
    "경기", "강원", "충북", "충남", "전북", "전남", "경북", "경남", "제주", "전국(지역제한없음)"
)


/**
 * 업종구분 -> mainCategory
 * 1차구분 -> firstCategory
 * 2차구분 -> secondCategory
 *
 * 공사의 1차구분: firstCategoryList_1
 * 구매의 1차구분: firstCategoryList_2
 *
 * 공사의 일반건설공사의 2차구분: secondCategoryList_1_1
 */
val mainCategoryList = listOf(
    "업종구분", "공사", "구매", "용역"
)

val firstCategoryList_1 = listOf(
    "==공사 전체==",
    "일반건설공사",
    "전문건설공사",
    "전문건설공사(대업종)",
    "전기/통신/산림/환경/기타공사"
)


val secondCategoryList_1_1 = listOf(
    "==일반건설공사 전체==",
   "토목공사",
    "토목건축공사",
    "건축공사",
    "조경고상",
    "산업.환경설비공사"
)

val secondCategoryList_1_2 = listOf(
    "==전문건설공사 전체==",
    "실내건축",
    "토공공사",
    "습식.방수공사업(미장방수조적)",
    "석공공사",
    "도장공사",
    "비계구조물해체",
    "석면해체,제거업",
    "금속구조물창호온실",
    "지붕판금건축물조립",
    "철근콘크리트공사",
    "상하수도공사",
    "보링그라우팅공사",
    "철도궤도공사",
    "포장공사",
    "수중공사",
    "조경식재공사",
    "조경시설물설치공사",
    "강구조물공사",
    "승강기설치",
    "철강재설치공사",
    "삭도설치.준설공사",
    "시설물유지관리",
    "기계설비공사업",
    "지하수개발업",
    "난방공사",
    "가스시설공사",
    "특정열사용기자재시공업",
    "정비사업(재건축,재개발,재정비등)",
    "문화재공사",
    "자연휴양림",
    "광해방지사업(토양개량.복원.정화)"
)

val secondCategoryList_1_3 = listOf(
    "==전문건설공사(대업종) 전체==",
    "(대)철강구조물공사업",
    "(대)수중,준설공사업",
    "(대)승강기,삭도공사업",
    "(대)기계가스설비공사업",
    "(대)가스난방공사업",
    "(대)지반조성.포장공사업",
    "(대)실내건축공사업",
    "(대)금속창호,지붕건출물조립소강업",
    "(대)도장,습식,방수,석공사업",
    "(대)조경식재,시설물공사업",
    "(대)철근,콘크리트공사업",
    "(대)구조물해체.비계공사업",
    "(대)상,하수도설비공사업",
    "(대)철도,궤도공사업"
)

val secondCategoryList_1_4 = listOf(
    "==전기/통신/산림/환경/기타공사 전체==",
    "전기공사",
    "정보통신공사",
    "일반소방시설(기계)",
    "일반소방시설(전기)",
    "전문소방시설공사",
    "대기/수질방지시설업(소음.진동방지)",
    "신재생에너지(전체)",
    "오수처리시설등설계.시공업",
    "산림사업법인(구)",
    "산립사업법인(도시림조성)",
    "산림조합",
    "산림사업법인(숲가꾸기/병해충)",
    "산림사업법인(나무병원)",
    "산림사업법인(산림토목/숲길)",
    "골재재취업(육상골재)",
    "기상장비업",
    "강선건조업,선박수리",
    "기타공사"
)

val firstCategoryList_2 = listOf(
    "==구매 전체==",
    "가구.사무용가구.교구/주방관련",
    "건설/시설자재",
    "조경관련",
    "기계장비/산업기계/농축산기계",
    "전기(UPS,자동제어),조명",
    "전동기/회전기기/축전지",
    "전자.통신.방송기기.신호등.소방안전.탐지(CCTV)",
    "군수품관련",
    "학교관련기타구매",
    "식음료/농.축.해산물(급식,부식)/건강보조",
    "운송기기/하역기계",
    "의료기기/의약품",
    "운동/레저/악기",
    "의류/섬유",
    "연료관련/원자재",
    "수처리.오염.환경/청소장비",
    "플라스틱/합성수지",
    "영상장비,사진/졸업앨범",
    "도서출판인쇄(안내.표지판)",
    "컴퓨터/사무기관련",
    "가전제품/냉난방.공조기.에어컨",
    "실험/계측기기/시험기",
    "동식물",
    "장의/커튼/상패/잡화",
    "기타"
)

val firstCategoryList_3 = listOf(
    "==용역 전체==",
    "엔지니어링",
    "감리관련",
    "설계관련",
    "안전진단",
    "광고/홍보/간판",
    "위탁(식당/어린이집/자판기/검침)등",
    "위생(청소/소독/물탱크/세탁/병원페기물)",
    "관리업",
    "신재생에너지",
    "측량/사진/드론",
    "연구.학술.경영.컨설팅.특허/리서치.조사",
    "폐기물",
    "컴퓨터통신",
    "문화재관련(수리/지표조사)",
    "보험",
    "리스/임대/대여",
    "은행/의료/장의(무연고.행려등)",
    "오수/분뇨/폐수",
    "수로조사",
    "운송/해운/여행/우편/택배",
    "기술사사무소",
    "민간투자",
    "어장정화",
    "환경평가",
    "전문자격(세무.회계.법무)",
    "전시/행사/이벤트/부스",
    "산업디자인(조각,조형물포함)",
    "비파괴검사",
    "알뜰시장",
    "재활용",
    "파견/대행/번역/교육/ISO",
    "보안,경비,무인경비",
    "전기안전/CCTV조사",
    "골재재취업",
    "석면조사",
    "건설/산림기술용역업",
    "기타용역"
)


val secondCategoryList_3_1 = listOf(
    "==엔지니어링 전체==",
    "기계,설비 ENG.",
    "전자.정보 ENG.",
    "건설 ENG.",
    "전기 ENG.",
    "환경 ENG.",
    "원자력/방사선/비파괴 ENG.",
    "농림/해양/수산 ENG.",
    "기타 ENG."
)
val secondCategoryList_3_2 = listOf(
    "==감리관련 전체==",
    "종합감리용역",
    "토목감리용역",
    "건축감리용역",
    "기계설비감리용역",
    "전력감리업",
    "일반소방감리",
    "전문소방공사감리",
    "정보시스템감리",
    "석면해체감리",
    "기타감리업"
)

val secondCategoryList_3_3 = listOf(
    "==설계관련 전체==",
    "건축관련설계",
    "설계업(전력)",
    "전문소방시설설계",
    "일반소방설계(기계)",
    "일반소방설계(전기)",
    "종합설계용역",

)
val secondCategoryList_3_4 = listOf(
    "==안전진단 전체==",
    "안전진단(교량및터널/항만/건축)",
    "안전진단(수리시설/전기/무대시설)"
    )

val secondCategoryList_3_5 = listOf(
    "==광고/홍보/간판==",
    "옥외광고업(안내.표지판.간판등)",
    "영상(홍보)물, 동영상제작",
    "광고.홍보.디자인.광고대행"
)

val secondCategoryList_3_6 = listOf(
    "==위탁(식당/어린이집/자판기/검침)등 전체==",
    "위탁용역(어린이집.교육시설/복지후생등)",
    "식탁위탁용역",
    "자판기관리",
    "기타관리위탁(검핌.기타유지운영관리등"
)

val secondCategoryList_3_7 = listOf(
    "==위생(청소/소독/물탱크/세탁/병원폐기물) 전체==",
    "소독",
    "세탁물처리, 병원폐기물처리",
    "위생관리용역업",
    "물탱크청소, 기타위생청소"
)
val secondCategoryList_3_8 = listOf(
    "==관리업 전체==",
    "안전관련관리업/항공선박관리.정비업",
    "소방시설관리업",
    "주택관리업",
    "건물(시설)관리",
    "자동차관리.정비업.세차",
    "주차장관리",
    "조림/영림/수목 관리",
    "승강깅지보수정비",
    "기타유지보수정비"
)

val secondCategoryList_3_9 = listOf(
    "==신재생에너지 전체==",
    "신재생에너지전문기업",
    "에너지절약전문기업(esco)",
)
val secondCategoryList_3_10 = listOf(
    "==측량/사진/드론 전체==",
    "측지측량업",
    "공공측량업",
    "항공사진관련업",
    "지도관련,해도제작",
    "지하시설물측량업",
    "해양조사정보업(수로사업)",
    "초경량비행장치사용사업(드론)",
    )
val secondCategoryList_3_11 = listOf(
    "==연구.학술.경영.컨설팅.특허/리서치.조사 전체==",
    "학술.연구.경영.컨설팅.특허",
    "원가계산용역",
    "리서치/조사/모집"
)

val secondCategoryList_3_12 = listOf(
    "==폐기물 전체==",
    "폐기물수집.운반",
    "폐기물처리업",
    "폐기물종합처리업",
    "폐기물해양수거업"
)
val secondCategoryList_3_13 = listOf(
    "==컴퓨터통신 전체==",
    "소프트웨어사업자/SI",
    "컴퓨터및주변기기유지보수",
    "정보보호",
    "기타정보통신관련"
)
val secondCategoryList_3_14 = listOf(
    "==문화재관련(수리/지표조사) 전체==",
    "문화재수리업",
    "문화재지표조사"
)
val secondCategoryList_3_15 = listOf(
    "==보험 전체==",
    "보험"
)
val secondCategoryList_3_16 = listOf(
    "==리스/임대/대여 전체==",
    "리스.임대.대여",
    "기계대여업"
)
val secondCategoryList_3_17 = listOf(
    "==은행/의료/장의(무연고,행려등) 전체==",
    "은행관련",
    "의료관련",
    "장의관련(분묘이장.무연고.행령 등",
    "기타 서비스"
)
val secondCategoryList_3_18 = listOf(
    "==오수/분뇨/폐수 전체==",
    "==오수/분뇨/폐수 용역",
)