package com.roulette.bidhelper.ui.bidinfo.spinners

val placeCategoryList = listOf(
    "지역제한선택", "서울", "부산", "인천", "대구", "광주", "대전", "울산", "세종",
    "경기", "강원", "충북", "충남", "전북", "전남", "경북", "경남", "제주", "전국(지역제한없음)"
)


/**
 * 업종구분 -> mainCategory
 * 1차구분 -> firstCategory
 * 2차구분 -> secondCategory
 *
 * 공사의 1차구분: firstCategoryList_1
 * 구매의 1차구분: firstCategoryList_2
 *
 * 공사의 일반건설공사의 2차구분: secondCategoryList_1_1
 */
val mainCategoryList = listOf(
    "업종구분", "공사", "구매", "용역"
)

val firstCategoryList_1 = listOf(
    "==공사 전체==",
    "일반건설공사",
    "전문건설공사",
    "전문건설공사(대업종)",
    "전기/통신/산림/환경/기타공사"
)

val firstCategoryList_2 = listOf(
    "==구매 전체==",
    "가구.사무용가구.교구/주방관련",
    "건설/시설자재",
    "조경관련",
    "기계장비/산업기계/농축산기계",
    "전기(UPS,자동제어),조명",
    "전동기/회전기기/축전지",
    "전자.통신.방송기기.신호등.소방안전.탐지(CCTV)",
    "군수품관련",
    "학교관련기타구매",
    "식음료/농.축.해산물(급식,부식)/건강보조",
    "운송기기/하역기계",
    "의료기기/의약품",
    "운동/레저/악기",
    "의류/섬유",
    "연료관련/원자재",
    "수처리.오염.환경/청소장비",
    "플라스틱/합성수지",
    "영상장비,사진/졸업앨범",
    "도서출판인쇄(안내.표지판)",
    "컴퓨터/사무기관련",
    "가전제품/냉난방.공조기.에어컨",
    "실험/계측기기/시험기",
    "동식물",
    "장의/커튼/상패/잡화",
    "기타"
)

val firstCategoryList_3 = listOf(
    "==용역 전체==",
    "엔지니어링",
    "감리관련",
    "설계관련",
    "안전진단",
    "광고/홍보/간판",
    "위탁(식당/어린이집/자판기/검침)등",
    "위생(청소/소독/물탱크/세탁/병원페기물)",
    "관리업",
    "신재생에너지",
    "측량/사진/드론",
    "연구.학술.경영.컨설팅.특허/리서치.조사",
    "폐기물",
    "컴퓨터통신",
    "문화재관련(수리/지표조사)",
    "보험",
    "리스/임대/대여",
    "은행/의료/장의(무연고.행려등)",
    "오수/분뇨/폐수",
    "수로조사",
    "운송/해운/여행/우편/택배",
    "기술사사무소",
    "민간투자",
    "어장정화",
    "환경평가",
    "전문자격(세무.회계.법무)",
    "전시/행사/이벤트/부스",
    "산업디자인(조각,조형물포함)",
    "비파괴검사",
    "알뜰시장",
    "재활용",
    "파견/대행/번역/교육/ISO",
    "보안,경비,무인경비",
    "전기안전/CCTV조사",
    "골재재취업",
    "석면조사",
    "건설/산림기술용역업",
    "기타용역"
)